In [75]:
import pandas as pd
import numpy as np
from sklearn.impute import KNNImputer
from sklearn.neighbors import KNeighborsClassifier

data = pd.read_csv('horse-colic.data', delimiter='\s+', header=None)
test = pd.read_csv('horse-colic.test', delimiter='\s+', header=None)

In [76]:
data = data.replace('?', np.nan)
data.head()

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
0,2,1,530101,38.50,66,28,3,3,NaN,2,...,45.00,8.40,NaN,NaN,2,2,11300,0,0,2
1,1,1,534817,39.2,88,20,NaN,NaN,4,1,...,50,85,2,2,3,2,2208,0,0,2
2,2,1,530334,38.30,40,24,1,1,3,1,...,33.00,6.70,NaN,NaN,1,2,0,0,0,1
3,1,9,5290409,39.10,164,84,4,1,6,2,...,48.00,7.20,3,5.30,2,1,2208,0,0,1
4,2,1,530255,37.30,104,35,NaN,NaN,6,2,...,74.00,7.40,NaN,NaN,2,2,4300,0,0,2

In [77]:
test = test.replace('?', np.nan)
test.head()

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
0,2,1,528626,38.50,54,20,NaN,1,2,2,...,42.00,6.30,NaN,NaN,1,2,3111,0,0,1
1,2,1,527950,37.60,48,36,NaN,NaN,1,1,...,44.00,6.30,1,5.00,1,2,3111,0,0,1
2,1,1,535263,37.7,44,28,NaN,4,3,2,...,45,70,3,2,1,1,3205,0,0,2
3,1,1,534523,37,56,24,3,1,4,2,...,35,61,3,2,3,2,2205,2208,0,2
4,2,1,528926,38.00,42,12,3,NaN,3,1,...,37.00,5.80,NaN,NaN,1,2,3111,0,0,2

In [104]:
data

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
0,2,1,530101,38.50,66,28,3,3,NaN,2,...,45.00,8.40,NaN,NaN,2,2,11300,0,0,2
1,1,1,534817,39.2,88,20,NaN,NaN,4,1,...,50,85,2,2,3,2,2208,0,0,2
2,2,1,530334,38.30,40,24,1,1,3,1,...,33.00,6.70,NaN,NaN,1,2,0,0,0,1
3,1,9,5290409,39.10,164,84,4,1,6,2,...,48.00,7.20,3,5.30,2,1,2208,0,0,1
4,2,1,530255,37.30,104,35,NaN,NaN,6,2,...,74.00,7.40,NaN,NaN,2,2,4300,0,0,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,1,1,533886,NaN,120,70,4,NaN,4,2,...,55,65,NaN,NaN,3,2,3205,0,0,2
296,2,1,527702,37.20,72,24,3,2,4,2,...,44.00,NaN,3,3.30,3,1,2208,0,0,1
297,1,1,529386,37.50,72,30,4,3,4,1,...,60.00,6.80,NaN,NaN,2,1,3205,0,0,2
298,1,1,530612,36.50,100,24,3,3,3,1,...,50.00,6.00,3,3.40,1,1,2208,0,0,1
299,1,1,534618,37.2,40,20,NaN,NaN,NaN,NaN,...,36,62,1,1,3,2,6112,0,0,2

In [105]:
target = 23
y = data[target-1]
x1 = data.loc[:, 1-1:2-1]
x2 = data.loc[:, 4-1:22-1]
# Place the DataFrames side by side
X = pd.concat([x1, x2], axis=1)

In [106]:
X.head()

,0,1,3,4,5,6,7,8,9,10,...,12,13,14,15,16,17,18,19,20,21
0,2,1,38.50,66,28,3,3,NaN,2,5,...,4,NaN,NaN,NaN,3,5,45.00,8.40,NaN,NaN
1,1,1,39.2,88,20,NaN,NaN,4,1,3,...,2,NaN,NaN,NaN,4,2,50,85,2,2
2,2,1,38.30,40,24,1,1,3,1,3,...,1,NaN,NaN,NaN,1,1,33.00,6.70,NaN,NaN
3,1,9,39.10,164,84,4,1,6,2,2,...,4,1,2,5.00,3,NaN,48.00,7.20,3,5.30
4,2,1,37.30,104,35,NaN,NaN,6,2,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,74.00,7.40,NaN,NaN

In [109]:
column_names = list(X)
column_names

[0, 1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21]

In [125]:
y[y.isnull() == True]
type(y.to_frame())
y.to_frame()
y

0      2
1      3
2      1
3      2
4      2
      ..
295    3
296    3
297    2
298    1
299    3
Name: 22, Length: 300, dtype: object

In [133]:
impute_knn = KNNImputer()
im = impute_knn.fit(X)
# im = impute_knn.fit_transform(X)
X = pd.DataFrame(impute_knn.fit_transform(X), columns=column_names).astype(int)
y = pd.DataFrame(impute_knn.fit_transform(y.to_frame())).astype(int)

In [134]:
y

     0
0    2
1    3
2    1
3    2
4    2
..  ..
295  3
296  3
297  2
298  1
299  3

[300 rows x 1 columns]

In [111]:
X

,0,1,3,4,5,6,7,8,9,10,...,12,13,14,15,16,17,18,19,20,21
0,2,1,38,66,28,3,3,3,2,5,...,4,2,1,5,3,5,45,8,1,3
1,1,1,39,88,20,2,2,4,1,3,...,2,1,1,2,4,2,50,85,2,2
2,2,1,38,40,24,1,1,3,1,3,...,1,2,1,5,1,1,33,6,1,3
3,1,9,39,164,84,4,1,6,2,2,...,4,1,2,5,3,4,48,7,3,5
4,2,1,37,104,35,3,2,6,2,3,...,3,1,1,4,3,4,74,7,2,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,1,1,38,120,70,4,3,4,2,2,...,3,1,1,2,3,5,55,65,2,2
296,2,1,37,72,24,3,2,4,2,4,...,3,3,1,5,4,4,44,6,3,3
297,1,1,37,72,30,4,3,4,1,4,...,3,2,1,5,3,5,60,6,2,3
298,1,1,36,100,24,3,3,3,1,3,...,3,3,1,5,4,4,50,6,3,3
299,1,1,37,40,20,2,2,2,1,2,...,2,1,1,1,4,1,36,62,1,1

In [99]:
im.get_params()

{'add_indicator': False,
 'copy': True,
 'metric': 'nan_euclidean',
 'missing_values': nan,
 'n_neighbors': 5,
 'weights': 'uniform'}

In [136]:
columns = ['surgery', 'Age', 'Hospital Number', 'rectal temperature', 'pulse', 'respiratory rate', 
          'temperature of extremities', 'peripheral pulse', 'mucous membranes', 'capillary refill time',
          'pain', 'peristalsis', 'abdominal distension', 'nasogastric tube', 'nasogastric reflux',
          'nasogastric reflux PH', 'rectal examination', 'abdomen', 'packed cell volume', 'total protein',
          'abdominocentesis appearance', 'abdomcentesis total protein', 'outcome', 'surgical lesion',
           'type of lesion', 'type of lesion', 'type of lesion', 'cp_data']